In [1]:
import sqlite3

In [ ]:
def c_table():

  conn = sqlite3.connect('team.db',timeout=10)
  print("Opened database successfully\n")

  conn.execute('''CREATE TABLE TEAM_INDIA
         (JID INT PRIMARY KEY,
         NAME TEXT    NOT NULL,
         TYPE_OF_PLAYER CHAR(50),
         MATCHES INT NOT NULL,
         INNINGS INT NOT NULL,
         RUNS INT NOT NULL,
         HIGHEST INT NOT NULL,
         BAT_AVG REAL NOT NULL,
         SR REAL NOT NULL,
         HUNDREDS INT,
         WKTS INT NOT NULL,
         ECON REAL NOT NULL,
         BOWL_AVG REAL);''')
  print("Table created successfully\n")

  conn.close()

c_table()

In [2]:
def ins_v():
  conn = sqlite3.connect('team.db',timeout=10)
  print("Opened database successfully\n")

  try:
    conn.execute("INSERT INTO TEAM_INDIA VALUES (1,'VIRAT KOHLI','BATSMAN',91,86,3225,94,52.02,137.94,0,4,8.25,49.5);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (2, 'ROHIT SHARMA','BATSMAN',114,106,2894,118,31.8,138.8,4,1,10.27,113);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (3, 'SHIKHAR DHAWAN','BATSMAN',67,66,1759,92,27.92,126.36,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (4, 'SHUBMAN GILL','BATSMAN',0,0,0,0,0.0,0.0,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (5, 'SHREYAS IYER','BATSMAN',28,26,550,67,28.95,133.82,0,0,0.0,0.0);")
  
    conn.execute("INSERT INTO TEAM_INDIA VALUES (6, 'MANISH PANDEY','BATSMAN',39,33,709,79,44.31,126.16,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (7, 'MAYANK AGARWAL','BATSMAN',0,0,0,0,0.0,0.0,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (8, 'PRITHVI SHAW','BATSMAN',1,1,0,0,0.0,0.0,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (9, 'CHETESHWAR PUJARA','BATSMAN',0,0,0,0,0.0,0.0,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (10, 'AJINKYA RAHANE','BATSMAN',20,20,375,61,20.83,113.29,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (11, 'KL RAHUL','WK_BATSMAN',51,48,1600,110,39.02,140.85,2,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (12, 'SANJU SAMSON','WK_BATSMAN',10,10,117,27,11.7,110.38,0,0,0.0,0.0);")
  
    conn.execute("INSERT INTO TEAM_INDIA VALUES (13, 'WRIDDHIMAN SAHA','WK_BATSMAN',0,0,0,0,0.0,0.0,0,0,0.0,0.0);")
  
    conn.execute("INSERT INTO TEAM_INDIA VALUES (14, 'RISHABH PANT','WK_BATSMAN',35,31,563,65,21.65,121.34,0,0,0.0,0.0);")
  
    conn.execute("INSERT INTO TEAM_INDIA VALUES (15, 'HARDIK PANDYA','ALL ROUNDER',52,35,518,42,19.19,141.92,0,42,8.23,26.86);")
  
    conn.execute("INSERT INTO TEAM_INDIA VALUES (16, 'HANUMA VIHARI','ALL ROUNDER',0,0,0,0,0.0,0.0,0,0,0.0,0.0);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (17, 'RAVINDRA JADEJA','ALL ROUNDER',53,26,256,44,17.07,113.78,0,39,7.16,30.85);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (18, 'RAVICHANDRAN ASHWIN','ALL ROUNDER',47,11,123,31,30.75,106.96,0,52,6.98,22.94);")
  
    conn.execute("INSERT INTO TEAM_INDIA VALUES (19, 'MOHAMMED SHAMI','BOWLER',15,2,0,0,0.0,0.0,0,12,10.04,40.17);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (20, 'JASPRIT BUMRAH','BOWLER',52,6,8,7,4.0,61.54,0,61,6.65,20.26);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (21, 'KULDEEP YADAV','SPINNER',22,3,43,23,43.0,89.58,0,41,7.15,14.22);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (22, 'YUZVENDRA CHAHAL','SPINNER',49,4,5,3,2.5,45.45,0,63,8.32,25.3);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (23, 'NAVDEEP SAINI','BOWLER',10,3,12,11,0.0,109.09,0,13,7.16,18.08);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (24, 'SHRADUL THAKUR','BOWLER',23,6,69,22,23.00,181.58,0,31,9.19,22.84);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (25, 'UMESH YADAV','BOWLER',7,1,2,2,2.0,50.0,0,9,8.76,24.33);")

    conn.execute("INSERT INTO TEAM_INDIA VALUES (26, 'MOHAMMED SIRAJ','BOWLER',3,0,0,0,0.0,0.0,0,3,12.33,49.33);")

    conn.commit()

    print("Records created successfully")
  
    conn.close()
    
  except:
    print('\nError Occured!!')
    conn.close()
    
ins_v()

Opened database successfully

Records created successfully

In [5]:
def disp_data():
  conn = sqlite3.connect('team.db',timeout=10)
  print("Opened database successfully\n");

  ans = conn.execute("SELECT * FROM TEAM_INDIA;")
  
  for row in ans:
   print(row,'\n')

  conn.close()

disp_data()

Opened database successfully

(1, 'VIRAT KOHLI', 'BATSMAN', 91, 86, 3225, 94, 52.02, 137.94, 0, 4, 8.25, 49.5)

(2, 'ROHIT SHARMA', 'BATSMAN', 114, 106, 2894, 118, 31.8, 138.8, 4, 1, 10.27, 113.0)

(3, 'SHIKHAR DHAWAN', 'BATSMAN', 67, 66, 1759, 92, 27.92, 126.36, 0, 0, 0.0, 0.0)

(4, 'SHUBMAN GILL', 'BATSMAN', 0, 0, 0, 0, 0.0, 0.0, 0, 0, 0.0, 0.0)

(5, 'SHREYAS IYER', 'BATSMAN', 28, 26, 550, 67, 28.95, 133.82, 0, 0, 0.0, 0.0)

(6, 'MANISH PANDEY', 'BATSMAN', 39, 33, 709, 79, 44.31, 126.16, 0, 0, 0.0, 0.0)

(7, 'MAYANK AGARWAL', 'BATSMAN', 0, 0, 0, 0, 0.0, 0.0, 0, 0, 0.0, 0.0)

(8, 'PRITHVI SHAW', 'BATSMAN', 1, 1, 0, 0, 0.0, 0.0, 0, 0, 0.0, 0.0)

(9, 'CHETESHWAR PUJARA', 'BATSMAN', 0, 0, 0, 0, 0.0, 0.0, 0, 0, 0.0, 0.0)

(10, 'AJINKYA RAHANE', 'BATSMAN', 20, 20, 375, 61, 20.83, 113.29, 0, 0, 0.0, 0.0)

(11, 'KL RAHUL', 'WK_BATSMAN', 51, 48, 1600, 110, 39.02, 140.85, 2, 0, 0.0, 0.0)

(12, 'SANJU SAMSON', 'WK_BATSMAN', 10, 10, 117, 27, 11.7, 110.38, 0, 0, 0.0, 0.0)

(13, 'WRIDDHIMAN SAHA', 'WK_BATSMAN', 0, 0, 0, 0, 0.0, 0.0, 0, 0, 0.0, 0.0)

(14, 'RISHABH PANT', 'WK_BATSMAN', 35, 31, 563, 65, 21.65, 121.34, 0, 0, 0.0, 0.0)

(15, 'HARDIK PANDYA', 'ALL ROUNDER', 52, 35, 518, 42, 19.19, 141.92, 0, 42, 8.23, 26.86)

(16, 'HANUMA VIHARI', 'ALL ROUNDER', 0, 0, 0, 0, 0.0, 0.0, 0, 0, 0.0, 0.0)

(17, 'RAVINDRA JADEJA', 'ALL ROUNDER', 53, 26, 256, 44, 17.07, 113.78, 0, 39, 7.16, 30.85)

(18, 'RAVICHANDRAN ASHWIN', 'ALL ROUNDER', 47, 11, 123, 31, 30.75, 106.96, 0, 52, 6.98, 22.94)

(19, 'MOHAMMED SHAMI', 'BOWLER', 15, 2, 0, 0, 0.0, 0.0, 0, 12, 10.04, 40.17)

(20, 'JASPRIT BUMRAH', 'BOWLER', 52, 6, 8, 7, 4.0, 61.54, 0, 61, 6.65, 20.26)

(21, 'KULDEEP YADAV', 'SPINNER', 22, 3, 43, 23, 43.0, 89.58, 0, 41, 7.15, 14.22)

(22, 'YUZVENDRA CHAHAL', 'SPINNER', 49, 4, 5, 3, 2.5, 45.45, 0, 63, 8.32, 25.3)

(23, 'NAVDEEP SAINI', 'BOWLER', 10, 3, 12, 11, 0.0, 109.09, 0, 13, 7.16, 18.08)

(24, 'SHRADUL THAKUR', 'BOWLER', 23, 6, 69, 22, 23.0, 181.58, 0, 31, 9.19, 22.84)

(25, 'UMESH YADAV', 'BOWLER', 7, 1, 2, 2, 2.0, 50.0, 0, 9, 8.76, 24.33)

(26, 'MOHAMMED SIRAJ', 'BOWLER', 3, 0, 0, 0, 0.0, 0.0, 0, 3, 12.33, 49.33)

In [23]:
def players_having_exp():
  conn = sqlite3.connect('team.db',timeout=10)
  print("Opened database successfully\n");

  ans = conn.execute("SELECT NAME FROM TEAM_INDIA WHERE MATCHES >= 10;")
  
  for row in ans:
   print(row[0],'\n')

  conn.execute("CREATE TABLE TEAM_EXP AS SELECT * FROM TEAM_INDIA WHERE MATCHES >= 10;")

  conn.commit()
  conn.close()

print("\nThese are the players Having Adequate International Experience : ")
players_having_exp()

These are the players Having Adequate International Experience :
Opened database successfully

VIRAT KOHLI

ROHIT SHARMA

SHIKHAR DHAWAN

SHREYAS IYER

MANISH PANDEY

AJINKYA RAHANE

KL RAHUL

SANJU SAMSON

RISHABH PANT

HARDIK PANDYA

RAVINDRA JADEJA

RAVICHANDRAN ASHWIN

MOHAMMED SHAMI

JASPRIT BUMRAH

KULDEEP YADAV

YUZVENDRA CHAHAL

NAVDEEP SAINI

SHRADUL THAKUR

In [3]:
conn = sqlite3.connect('team.db',timeout=10)
conn.close()

In [39]:
conn = sqlite3.connect('team.db',timeout=10)
print("Opened database successfully\n")
bat = conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'BATSMAN\' AND SR >= 130.0;')
for a in bat:
  print(a)
conn.close()

Opened database successfully

(1, 'VIRAT KOHLI', 'BATSMAN', 91, 86, 3225, 94, 52.02, 137.94, 0, 4, 8.25, 49.5)
(2, 'ROHIT SHARMA', 'BATSMAN', 114, 106, 2894, 118, 31.8, 138.8, 4, 1, 10.27, 113.0)
(5, 'SHREYAS IYER', 'BATSMAN', 28, 26, 550, 67, 28.95, 133.82, 0, 0, 0.0, 0.0)

In [43]:
conn = sqlite3.connect('team.db',timeout=10)
print("Opened database successfully\n")
wkbat = conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'WK_BATSMAN\' AND RUNS>500 AND SR >= 120.0;')
for a in wkbat:
  print(a)
conn.close()

Opened database successfully

(11, 'KL RAHUL', 'WK_BATSMAN', 51, 48, 1600, 110, 39.02, 140.85, 2, 0, 0.0, 0.0)
(14, 'RISHABH PANT', 'WK_BATSMAN', 35, 31, 563, 65, 21.65, 121.34, 0, 0, 0.0, 0.0)

In [44]:
conn = sqlite3.connect('team.db',timeout=10)
print("Opened database successfully\n")
sp = conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'SPINNER\' AND WKTS >= 30 AND ECON < 8.5;')
for a in sp:
  print(a)
conn.close()

Opened database successfully

(21, 'KULDEEP YADAV', 'SPINNER', 22, 3, 43, 23, 43.0, 89.58, 0, 41, 7.15, 14.22)
(22, 'YUZVENDRA CHAHAL', 'SPINNER', 49, 4, 5, 3, 2.5, 45.45, 0, 63, 8.32, 25.3)

In [45]:
conn = sqlite3.connect('team.db',timeout=10)
print("Opened database successfully\n")
ar= conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'ALL ROUNDER\' AND SR >= 110.0 AND WKTS>20;')
for a in ar:
  print(a)
conn.close()

Opened database successfully

(15, 'HARDIK PANDYA', 'ALL ROUNDER', 52, 35, 518, 42, 19.19, 141.92, 0, 42, 8.23, 26.86)
(17, 'RAVINDRA JADEJA', 'ALL ROUNDER', 53, 26, 256, 44, 17.07, 113.78, 0, 39, 7.16, 30.85)

In [55]:
conn = sqlite3.connect('team.db',timeout=10)
print("Opened database successfully\n")
bowl = conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'BOWLER\' AND WKTS >= 15 AND ECON<10 ;')
for a in bowl:
  print(a)
conn.close()

Opened database successfully

(20, 'JASPRIT BUMRAH', 'BOWLER', 52, 6, 8, 7, 4.0, 61.54, 0, 61, 6.65, 20.26)
(24, 'SHRADUL THAKUR', 'BOWLER', 23, 6, 69, 22, 23.0, 181.58, 0, 31, 9.19, 22.84)

In [58]:
conn = sqlite3.connect('team.db',timeout=10)

print('\nPlayers Selected For Playing 11 in Team India : ')
for i in conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'BATSMAN\' AND SR >= 130.0;'):
  print('\nBatsman : ' ,i)

for i in conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'WK_BATSMAN\' AND RUNS>500 AND SR >= 120.0;'):
  print('\nWicket-Keeper Batsman : ',i)

for i in conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'ALL ROUNDER\' AND SR >= 110.0 AND WKTS>20;'):
  print('\nAll Rounder : ',i)

for i in conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'SPINNER\' AND WKTS >= 30 AND ECON < 8.5;'):
  print('\nSpinner : ',i)

for i in conn.execute('SELECT * FROM TEAM_EXP WHERE TYPE_OF_PLAYER=\'BOWLER\' AND WKTS >= 15 AND ECON<10 ;'):
  print('\nBowler : ',i)

conn.close()

Players Selected For Playing 11 in Team India :

Batsman :  (1, 'VIRAT KOHLI', 'BATSMAN', 91, 86, 3225, 94, 52.02, 137.94, 0, 4, 8.25, 49.5)

Batsman :  (2, 'ROHIT SHARMA', 'BATSMAN', 114, 106, 2894, 118, 31.8, 138.8, 4, 1, 10.27, 113.0)

Batsman :  (5, 'SHREYAS IYER', 'BATSMAN', 28, 26, 550, 67, 28.95, 133.82, 0, 0, 0.0, 0.0)

Wicket-Keeper Batsman :  (11, 'KL RAHUL', 'WK_BATSMAN', 51, 48, 1600, 110, 39.02, 140.85, 2, 0, 0.0, 0.0)

Wicket-Keeper Batsman :  (14, 'RISHABH PANT', 'WK_BATSMAN', 35, 31, 563, 65, 21.65, 121.34, 0, 0, 0.0, 0.0)

All Rounder :  (15, 'HARDIK PANDYA', 'ALL ROUNDER', 52, 35, 518, 42, 19.19, 141.92, 0, 42, 8.23, 26.86)

All Rounder :  (17, 'RAVINDRA JADEJA', 'ALL ROUNDER', 53, 26, 256, 44, 17.07, 113.78, 0, 39, 7.16, 30.85)

Spinner :  (21, 'KULDEEP YADAV', 'SPINNER', 22, 3, 43, 23, 43.0, 89.58, 0, 41, 7.15, 14.22)

Spinner :  (22, 'YUZVENDRA CHAHAL', 'SPINNER', 49, 4, 5, 3, 2.5, 45.45, 0, 63, 8.32, 25.3)

Bowler :  (20, 'JASPRIT BUMRAH', 'BOWLER', 52, 6, 8, 7, 4.0, 61.54, 0, 61, 6.65, 20.26)

Bowler :  (24, 'SHRADUL THAKUR', 'BOWLER', 23, 6, 69, 22, 23.0, 181.58, 0, 31, 9.19, 22.84)